package java04_control.loof;

public class For_01 {
	public static void main(String[] args) {
		
			//반복문, loop
			//	 for문, while문, do-while문
			
			//for문, for loop
			
	//	for( 초기식; 조건식; 증감식) {
	//		
	//		//조건식이 true라면 수행하는 코드 영역
	//		//반복적으로 수행한다
	//		
	//	}
		
		//----------------------------------------------
		
		int i=0;
		for( i=0; i<5; i++) {
			System.out.println("HI: " + i);
		}
		
		//초기식: i=0
		//조건시: i<5
		//증감식: i++
		
		//	i변수가 0부터 시작해서
		//	i변수가 5보다 작은 동안에
		//	i씩 증가시키면서 반복한다
		
		//----------------------------------------------
		
		//for문의 수행 순서
		//	1. 초기식 수행
		//	2. 조건식 판별
		// 		2-1. true일 때, 3번항목 수행
		//		2-2. false일 때, for문 종료(반복문 중단)
		//	3. {}중괄호 코드 수행
		//	4. 증감식 수행
		//	5. 2번항목 수행
		
		
		
		
		
	}
}
